根據題目給的 DataFrame 完成下列操作：
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False

In [2]:
import numpy as np
import pandas as pd

In [7]:
data = {
    'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
    'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
    'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']
}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data,index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [8]:
for ani in set (df['animal']):
    print(ani,df[df['animal']==ani]['age'].mean())

cat 2.5
dog 5.0
snake 2.5

In [15]:
df1 = df.sort_values(by=['age'])
df2 = df1.sort_values(by=['visits'],ascending=False)
df2

  animal  age  visits priority
f    cat  2.0       3       no
b    cat  3.0       3      yes
d    dog  NaN       3      yes
c  snake  0.5       2       no
e    dog  5.0       2       no
i    dog  7.0       2       no
a    cat  2.5       1      yes
j    dog  3.0       1       no
g  snake  4.5       1       no
h    cat  NaN       1      yes

一個包含兩個欄位的 DataFrame，將每個數字減去

* 1) 該欄位的平均數
* 2) 該筆資料平均數

In [34]:
df = pd.DataFrame(np.random.random(size=(5, 3)),columns=['A','B','C'])
df

          A         B         C
0  0.778751  0.891957  0.804942
1  0.442688  0.207943  0.576111
2  0.487672  0.681158  0.038187
3  0.949426  0.760844  0.451628
4  0.850615  0.433735  0.810092

In [35]:
col_mean =df.mean(axis=0)

df_1 = df-col_mean
df_1

          A         B         C
0  0.076920  0.296830  0.268750
1 -0.259142 -0.387184  0.039919
2 -0.214158  0.086031 -0.498005
3  0.247596  0.165717 -0.084564
4  0.148784 -0.161393  0.273900

In [45]:
A_mean = df.A.mean()
B_mean = df.B.mean()
C_mean = df.C.mean()

A = [df['A']-A_mean]

[0    0.076920
 1   -0.259142
 2   -0.214158
 3    0.247596
 4    0.148784
 Name: A, dtype: float64]

承上題，請問：

* 1) 哪一比的資料總合最小
* 2) 哪一欄位的資料總合最小

In [46]:
A_sum = df.A.sum()
B_sum = df.B.sum()
C_sum = df.C.sum()

print('A_sum',A_sum,'B_sum',B_mea,'C_mean',C_mean)

A_mean 0.7018304491981432 B_mean 0.5951274214726334 C_mean 0.5361919947491891